<template>
  <list-container :list="list" v-if="!loading"></list-container>
</template>

<script>
export default {
  name: "listContent",
  components: {
    "list-container": () => import("./ListContainer")
  },
  data() {
    return {
      list: [],
      loading: true
    }
  },
  mounted() {
    this.loading = true
    setTimeout(() => {
      this.list = [
        "装修风格撒大声地个装修风格撒大声地个装修风格撒大声地个装修风格撒大声地个装修风格撒大声地个装修风格撒大声地个装修风格撒大声地个装修风格撒大声地个装修风格撒大声地个装修风格撒大声地个装修风格撒大声地个装修风格撒大声地个装修风格撒大声地个装修风格撒大声地个装修风格撒大声地个装修风格撒大声地个装修风格撒大声地个装修风格撒大声地个装修风格撒大声地个装修风格撒大声地个装修风格撒大声地个装修风格撒大声地个装修风格撒大声地个装修风格撒大声地个装修风格撒大声地个装修风格撒大声地个",
        "装修风格撒大声地个",
        "装修风格撒大声地个装修风格撒大声地个装修风格撒大声地个",
        "装修风格撒大声地个装修风格撒大声地个",
        "装修风格撒大声地个装修风格撒大声地个",
        "装修风格撒大声地个装修风格撒大声地个",
        "装修风格撒大声地个装修风格撒大声地个",
        "装修风格撒大声地个装修风格撒大声地个装修风格撒大声地个装修风格撒大声地个装修风格撒大声地个装修风格撒大声地个装修风格撒大声地个装修风格撒大声地个装修风格撒大声地个装修风格撒大声地个装修风格撒大声地个装修风格撒大声地个装修风格撒大声地个装修风格撒大声地个装修风格撒大声地个装修风格撒大声地个装修风格撒大声地个装修风格撒大声地个装修风格撒大声地个装修风格撒大声地个装修风格撒大声地个装修风格撒大声地个装修风格撒大声地个装修风格撒大声地个装修风格撒大声地个装修风格撒大声地个",
        "装修风格撒大声地个装修风格撒大声地个装修风格撒大声地个装修风格撒大声地个装修风格撒大声地个装修风格撒大声地个装修风格撒大声地个装修风格撒大声地个装修风格撒大声地个装修风格撒大声地个装修风格撒大声地个装修风格撒大声地个装修风格撒大声地个装修风格撒大声地个装修风格撒大声地个装修风格撒大声地个装修风格撒大声地个装修风格撒大声地个装修风格撒大声地个装修风格撒大声地个装修风格撒大声地个装修风格撒大声地个装修风格撒大声地个装修风格撒大声地个装修风格撒大声地个装修风格撒大声地个",
        "装修风格撒大声地个装修风格撒大声地个装修风格撒大声地个装修风格撒大声地个装修风格撒大声地个装修风格撒大声地个装修风格撒大声地个装修风格撒大声地个装修风格撒大声地个装修风格撒大声地个装修风格撒大声地个装修风格撒大声地个装修风格撒大声地个装修风格撒大声地个装修风格撒大声地个装修风格撒大声地个装修风格撒大声地个装修风格撒大声地个装修风格撒大声地个装修风格撒大声地个装修风格撒大声地个装修风格撒大声地个装修风格撒大声地个装修风格撒大声地个装修风格撒大声地个装修风格撒大声地个",
        "装修风格撒大声地个装修风格撒大声地个装修风格撒大声地个装修风格撒大声地个装修风格撒大声地个装修风格撒大声地个装修风格撒大声地个装修风格撒大声地个装修风格撒大声地个装修风格撒大声地个装修风格撒大声地个装修风格撒大声地个装修风格撒大声地个装修风格撒大声地个装修风格撒大声地个装修风格撒大声地个装修风格撒大声地个装修风格装修风格撒大声地个装修风格撒大声地个装修风格撒大声地个装修风格撒大声地个装修风格撒大声地个装修风格撒大声地个"
      ]
      this.loading = false
    }, 200)
  }
}
</script>

<style scoped></style>
